loadtest/loadtest.yml
config:
  target: 'https://5xhgfqhpgik599bg2d9v.tk'
  http:
    tls:
      rejectUnauthorized: false
      timeout: 10
    maxSockets: 2
  phases:
    - 
      duration: 2
      arrivalCount: 20
      name: "warming up"
  processor: './randomize.js'
  payload:
    path: "users.csv"
    fields:
      - "tel"
      - "id"
    order: "sequence"
scenarios:
  - flow:
    - post:
        url: "/login"
        form: 
          id: "{{id}}"
          tel: "{{tel}}"
        capture:
          json: "$.data.token"
          as: "token"
    - log: "[LOGIN] {{id}}:{{tel}} -> {{token}}"
    - loop:
      - post:
          url: "/movePerson"
          beforeRequest: "randomHouse"
          form:
            id: "{{id}}"
            token: "{{token}}"
            house: "{{house}}"
          afterResponse: "logRes"
      count: 15
    # - post:
    #     url: "/confirmHouse"
    #     form: 
    #       id: "{{id}}"
    #       token: "{{token}}"
    #     capture:
    #       json: "$.message"
    #       as: "msg"
    - log: "[Confirm] {{id}} -> {{msg}}"